{
  "micros": [
    {
      "content": "# Examples for Flutter Web\n\n Original URL with my reddit comment: [r/FlutterDev](https://www.reddit.com/r/FlutterDev/comments/qmi639/please_drop_the_link_to_your_flutter_web_apps/hk78k5p/?context=3) As you might notice, I am a fan of Flutter Web 💙🕸\n\n(btw, if you are a fan of Flutter Web then add 💙🕸 to your profile titles, so it will be easier for our sect to notice colleagues)\n\nThere was a discussion on Reddit (*0). Someone asked to provide examples for Flutter PWAs.\n\n# Here is my full post\n\n## I have half dozens of Flutter web apps as examples 👍💪👇 :)\n\nI've been the Flutter Web user from the very first day they announced it as a \"one more thing\" at their first conference.\n\nI immediately compiled my interactive fiction runner & editor for the web and it all worked from the very beginning.\n\n**Here is up to date version of my first flutter web app (interactive fiction runner&editor)**\n\n[https://locadeserta.com/game/?lang=en#/](https://locadeserta.com/game/?lang=en#/)\n\n\n🧠 My very latest **trading game Chumaki also has a Web version** (make sure to switch to English)\n\n[https://locadeserta.com/chumaki/](https://locadeserta.com/chumaki/)\n\n\nAnd, I think, the **most 🤯 sophisticated ever made Flutter Web app is my previous game Loca Deserta: Sloboda**. This is a task-based city building strategy game that has multiple maps, researches, building upgrades, random events, interactive fiction embeddings, and tones of other features:\n\n(make sure to change language to EN at the top :) )\n\n[https://locadeserta.com/sloboda/#/](https://locadeserta.com/sloboda/#/)\n\n**The last game I did for fun: Hex Puzzle 🧩:**\n\n[https://locadeserta.com/hex/#/](https://locadeserta.com/hex/#/)\n\n\nLinks to iOS/Android/Windows builds of the same games are all here 👇\n\n[http://locadeserta.com/index\\_en.html](http://locadeserta.com/index_en.html)\n\n\n✍ I blog about the Flutter & Game dev in articles like this:\n\n[https://dmytrogladkyi.com/#/catalog/posts/flutter\\_animate\\_interactive\\_viewer\\_as\\_map](https://dmytrogladkyi.com/#/catalog/posts/flutter_animate_interactive_viewer_as_map)\n\n\n```\n^^^ that site is also Flutter Web 🕸💙\n```\n\n\n## As for performance\n\nI have iPhone 11, Galaxy Tab S7, Sony Xperia XZ1 Compact, Galaxy Note 10 Lite, Galaxy S21/S21Ultra, iPad 2017, Nokia 5.2, Oukitel 10000\n\n\nOn all of these devices my games runs very smoothly, **except on Galaxy Note 10 Lite**. I think its CPU is underpowered (some mediatek...) that is why it lacks so much behind.\n\n\n👉I like to go to smartphone shops and check my online games. **I must say that in last year the new cheap devices like Meizu/Xiaomi started performing quite well when I open my games in Android Browser.** Any other devices in a range $500+ will perform well\\*. I think Snapdragon 855 is a minimum requiremenet to have 60FPS in Flutter Web.\\* Of course, sometimes there are glitches, but they are present even in \"real\" web apps done with JS and HTML. Page refresh fixes it as usual haha.\n\n\n**👑 iOS Safari is an absolute King of performance** as it was running 60FPS even back in 2018\n\n\nPer tweets from Flutter team they started giving 💙🕸 more time. I expect starting screen improvements, reduced bundle size, improvements in PWA to be merged in next stable release.\n\n\nStay tuned and Always Bet on Flutter (c) Dmytro Gladkyi",
      "publishedOn": "2021-11-23",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# Засилля шарлатанів. \n\n Навіяно [Черговими помиями копірайтерів на ДОУмийці](https://dou.ua/forums/topic/35415) \n\n Якось ще 5 років тому, ось ці всі психологи, психологіні, гештальт коучери вигорання і інші паразити взагалі не існували в наших степах. Але щось трапилося, і кожна друга контора строчить ось такі пости *0 на ДОУмийку ![4.png](4.png) При чому, що створюється така кількість контенту на всіх ресурсах, що інші люди теж починають думати, що у них проблеми з головою, токсікі в командах, нещасливе дитинство, батько алкаш і тд. \n\n\n\nХоча насправді, ці шарлатани лише відпрацьовують своє лаве, створюючи проблеми там, де їх немає. Прямо як agile coaches та скрам мастера. Судячи з усього, через пару років їх витіснять ось такі PhD Psychology з інститута Макаренка, факультет вивчення Пірамідок. Будуть сидіти на дейліка і питати у нас, \"як вигорів, чому не хочеш брати цю таску з 2017 року в джирі, може проблема в тобі?\"\n\n",
      "publishedOn": "2021-11-19",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "I like it when Devs of Old Web say that Flutter is not the Future because it would break all the web.\n\nyet a single Ad Block extension ruins 99% of their web sites that don't even load anymore. And these pages have no interactivity at all",
      "publishedOn": "2021-11-19",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# MetaPersona progress\n\n Finally I had time to implement micro blogging on meta persona profile: [This site](https://dmytrogladkyi.com) I can now embed tiny markdowns, even with images for each micro. \n\n Like this: ![3.png](3.png) \n\n Micro is a Tweet but in Meta Persona context. Check sources on [https://github.com/gladimdim/metapersona](https://github.com/gladimdim/metapersona)",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# First MetaMicro ever.\n\nThis is my first Meta Micro post ever added to #metapersona profile\n\nThis can have something embedded inside\n\nOr maybe not hehe\n\n How are you?",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# 🌟 Другий мікро українською :)",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# 🌟 Перший мікро українською :)",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇦"
    }
  ]
}