{
  "micros": [
    {
      "content": "Ось всі дивуються, чому Німеччина така незграбна і лише оголошує про добрі наміри, а сама нічого не робить або навіть блокує допомогу нам.\n\n---\n\n# Власний досвід\n\nА мені по роботі часто приходиться працювати из колегами звідти. І...вони всі такі. Безкінечні черги мітингів, якісь поверпойнти з рожевим майбутнім продукту, замість обговорення поточних проблем і шляхів їх вирішення - тобі починають заливати космічні кораблі в малом театрі планів на 2032 рік. При чому, що на словах - всі готові в бій, всі все розуміють. Як тікі доходить до реалізації - все, повна блокада.\n\nІ що саме страшне - як тільки ти починаєш діяти, тобі одразу як під дих дають: \n\n\\- а ти спитав?\n\\- а де мітинг де ми це обговорювали?\n\\- давай поговоримо _з ще пятю командами_\n\\- збери мітинг. ой сорян, я у відпустку на 2 місяці, давай в липні уже?\n\\- ти не заповнив документ на 15 сторінок. Із них 12 - це питання до АБАП гімна якогось.\n\\- зараз це не можна робити, бо ми уже все перепридумали заново на 2032 рік\n\nІ ти от сидиш і уже думаєш: Ок, роблю по останнім планам на 2032 рік і...., плани уже на 2035 рік і все не так як зараз!\n\n\n\n---\n\n# Доктор Німець\n\nОсобисто для мене, марево всемогутності і все розуміності німецьких розробників упала разом з моїм тренінгом в 2013.\n\nТам зібрали команду аборигенів (і дали одного китайця, про нього пізніше), щоб я передавав їм свої премудрості (як завжди, проект виявився вдалим і тут же ж треба миттєво, щоб все дісталося головному офісу, ну то таке :) ). Було в команді три німця. Один з ніх доктор наук. Не жартую. Він ігнорував всіх, хто звертався до нього без приставки Доктор. Через це почав ходити на обіди сам і швидко змирився, що він просто Олаф і уже не виябувався.\n\nКоротше. Я їм перші 2 тижні розповідав, як програмувати на ЖС. І ще тиждень, що таке проміси. Для людини, у якої в списку 5 патентів по базам і зберіганням даним...Китаєц (студент інтерн) схавав все за 5 днів і на шостий уже комітив в продукт. \n\nДоктор Німець же почав вимагати тренінгів, дей офів на опрацювання домашки...він за 5 місяці не зробив НІЧОГО. Взагалі. Жодного коміту. Інші аборигени комітили працю в стилі \"Діма все зробив, вислав їм, а вони вкомітали\". Зате Доктор з пихатим виглядом розповідав, що так не можна працювати, що треба все осмислити, обдумати, обговорити, і тільки тоді сідати щось робити. Досі памятаю його пихатість до відношення до не расових представників...Я трошки почав це обрубати і , користуючись тим, що на мене там капали, капать на нього його ж менеджменту :-) (без всяких угризінь совісті, око за око). В кінці моєї каденції він розплакався прямо в офісі, взяв дей оф, потім 5 днів сік деїв, потім САБАТІКАЛ на 3 місяці.\n\nОсь вам і Німеччина. Всі дуже розумні, всі все знають, всі роблять вигляд, що треба до них звертатися і вони все розрулять тут всяким унтерам. А реальну роботу роблять інтерн китайці і всякі чувакі зі сходу :)\n\n# Звісно, це все власний досвід. У кожного він свій.",
      "dateAdded": "2022-04-12",
      "languageEmoji": "🇺🇦"
    }, {
      "content": "# Telegram - новий інтернет.\n\nЯ (звісно як ІТ Батя), це знав давно, що ТГ боти і канали колись захоплять все. Але ось трапилася війна, а вони, як всі знають, прискорюють всі просеци в 5 разів.\n\nХто останній раз лазив по форумах? Всі сидять в ТГ канал з різними людьми. Однокласники, одногрупники, колеги, команда - у всіх свої окремі ТГ островки.\n\nХто останній раз читав новинарний сайт? Все в Тг каналах, при чому без тупого розжовування ось цих \"редакцій журнаглістів\", з вставкою реклами лікування грибку нігтів, чи нового наряду Кіркорова.\n\nВ тг каналі: просто текст + картинка чи відео. Все. А більш ж і не треба! Хто застав інет кінця 90х, той знає, що був просто текст і пару картинок. Грузилося навіть на 14к за пару секунд.\n\nА зараз відкрий веб сайт цензор чи правду:\n\n\\- 10Мб джаваскрипта\n\\- якась хуєта про кукі\n\\- 2Мб CSS, щоб все сучасне гавнішко розпарсилось на мобілках\n\\- ще штук 230 реквестів на всякі трекалки і рекламні агенції\n\\- Новини, які прочитав ще вчора. З медіа делівері системою з гавном-роздатчиком медіа контенту десь з антарктиді чи гонг конгу.\n\\- пару попапів підписок на новини\n\\- ще попап нотифікацій.\n\nА ось дружина вчора шукала лікі для батька. Їй дали ТГ канал (бот). Вона, через цей ТГ бот: знайшла ліки, оформила заявку, отримала рахунок, оплатила рахунок, отримала підвердження формування посилки. Все через ТГ бот. З мінімумом вашого сраного клієнтського коду на реактах і рагулярах. З однаковим UI для всіх платформ і ботів! Це взагалі фантастика. Не треба більше заморочуватися з тупими рішеннями дизайнерів. Все у всіх однакове. Заходиш на іншому девайсі - не треба ні логиниться, ні згадувати паролі. Всі боти і канали тут. Весь їх стейт теж відновлений.\n\nВирішив теж накатать телеграм бот для [https://sluha.ch](https://sluha.ch/) ! Щоб у звичному для всіх телеграмчику можна було слухати історії про піратів та майнкрафт :) Але в цей раз візьму C# як платформу, а не дарт. Бо дарт на бекені...ну таке. Краще не юзати лол.\n\n![telegram_bot.jpg](telegram_bot.jpg)",
      "dateAdded": "2022-03-26",
      "languageEmoji": "🇺🇦"
    }, {
      "content": "# Журнодно\n\n\n\nБез інету були 8 днів. Прийшлося включити телік. Випадково трапили на отой \"телемарафон\" всіх каналів.\n\nЯкщо хтось застав в дитинстві УТ-1, то знає, про що там було. Так як в ТГ каналах ми в основному дивилися спалені колони, упавших льотчиків, удари точками У. То перемикання на \"журналіздні\" новини викликало шок.\n\nПриблизна канва всіх новин від усіх каналів, які запустили слуги:\n\n\\- НАРОДИЛА трійню в укритті\n\\- ВІДКОПАЛИ КОТА 2 ДНІ У ПІДВАЛІ\n\\- Ахметов відправив 20 міліардів тон вантажу (кудись)\n\\- Гімн разів 20 за годину\n\\- Промова Зеленського (кожні 5 хв)\n\\- Гімн ще раз\n\\- Якась бабуся плаче в підвалі\n\\- Назвали собаку Байрактаром.\n\\- Скайп включення Лжичко, яка (мабуть в трусах уже) з карпат розповідає, як буде захищати землю на концертах\n\\- Скайп включення журналістки, яка 20 хв показує, як розвантажують картоплю.\n\\- БЛИСКАВКА: Ворог розбомбив склад картоплі (не жарт, це реал новина була)\n\\- Нам піздец, ми нікому не потрібні, але ми сильні і виграємо, якось! За нами Зе!\n\n**Щоб ви розуміли, це все окремі зняті сюжети.**\n\nПотім випадково знайшли телемарафон від Еспресо і Прямий.\n\nось це новини!\n\n\\- відео боїв за бучу\n\\- статистика знищенної русні кожні 5 хв\n\\- відоси палаючих колон\n\\- Порох на задньому плані кудись пішов\n\\- Хопа Порох уже в Ірпіні роздає шоломи\n\\- Скайп включення старших офіцерів з передових\n\\- Скайп включення голов ОДА різних міст\n\\- Відео 200х\n\\- Інтервью полонених\n\\- Полонені плачуться мамкам по телефону\n\\- Політологи розповідають про санкції і як вони працюють.\n\\- Аналітики про військові неуспіхи росіян і чому ми все робимо вірно.",
      "dateAdded": "2022-03-11",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Одинацятий день. 5 березня.\n\nВстали в 6 ранку. Будемо виїжджати в Київ. Дай бог все вийде і в обід уже будемо на свободі.",
      "dateAdded": "2022-03-10",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Десятий день. 5 березня.\n\nХодили далеко під ліс, щоб був кращий зв'язок. Всі живі. Все добре.\n\nТільки що в 14:00 вийшли з дітьми погуляти. Світлана побачила за мостом метрах в 300 від нас БМП. Навколо нього ходили солдати і обдивлялися стан мосту. Ми почали тікати назад. Росіяни почали стріляти з гарматки і кулемета. Але схоже, не по нам, а вгору, щоб ми втікли. Взяв Михайла під мишку і тікали. Світлана тягла Даринку. Данило біг сам.\n\nВирішили завтра полями вибиратися з оточення. Спробуємо через Згурівку прорватися.\n",
      "dateAdded": "2022-03-10",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Дев'ятий день війни. 4 березня.\n\nБув свідком авіаудару. Два літаки зайшли на атаку. Все було дуже швидко, я встиг засняти на відео момент обох ударів.\n\nЗаписав відео і Дике Поле #8.\n\nДуже погано без інтернету, без інформації нічого не знаєш і не розумієш.\n\nГодину тому був ще один авіаудар. Ми як раз ішли подзвонити олі, сказати що живі і тут почули звуки літаків. Їх знову було двоє. Удар був десь в те саме місце. саме не знаємо куди. Вони копошаться, чутно звуки танків. Начебто уходять назад, але не знаю точно. Як би добре було, якби вони пішли! Тоді можна було б вибратися в Київ. Там хоча б є їжа. А далі б думали, куди тікати далі. Але схоже, що в Русанові підірваний міст, тому чи можна буде проїхати...\n\n17:58 було ще два авіаудара. Щось горіло і вибухало, росіяни прострілювали міст. Походу попали в БК, бо горіло довго і чутно вибухи патронів чи снарядів.\n\nНаразі завісили взагалі всі вікна. Будемо спати вдягнені, щоб одразу в кювет, підвал.\n",
      "dateAdded": "2022-03-10",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "Про психологічні типи.\n\n \n\nПомітив наступні поведінкових типи.\n\n \n\n1. Отрицатель. 8й день війна, а людина робить вигляд, що все ок: виходить з ліхтарем на вулицю вночі. Каже     навіщо ховати продукти, ніхто не прийде. Не треба накривати машини, хай     світять на пів села катафотами. Не треба їжа, це на 3 дні і тд.     Найогидніший тип з усіх, якщо він поруч. Всіх інших називає панікерами.     Вносить мало корисного, адже постійно каже \"це на 3 дні\".\n2. Дебіл-патріот. Втік кудись в Карпати, в тг знає, що ти уже в окупації і шле тобі \"скільки спалив     танків? :))))\", \"Бери ножа і вперед!!!\", \"Записався в  тероборону Ужгорода!!! Їм жопа!!!\".\n3. Панікери. Бігають з  виряченими очима, не думають на 3 дні наперед. Розповсюджують якісь     меседжі з вайбера про все пропало.\n4. Бойовики. Записався в     тероборону, взяв калаша. Бігає хер зна де. Фоткається, розповідає як в     сусідньому селі знищили десант, але він не встиг добігти до них.\n5. Під окупацією. На мою думку,  самі реальні люди. В патріотизм уже не грають, думають як вижити, де взяти їжі дітям, як би пережити авіаудар. Фільтрують меседжі. Сруть на \"допомогу ЄС\", бо це все зіжруть десь за 400км від нього в Тернополі.",
      "dateAdded": "2022-03-10",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Восьмий день. 3 березня.\n\n \n\nЗв'язку досі немає. В іншій частині села дали світло. Військові стріляють по мирним, якщо ті десь лазять. Обстріляли дядька на мосту, той вийшов подивитися. Обстріляли тьотку на велосипеді. Та їхала через міст. Назад повзла уже. Погано, що немає зв'язку.\n\n \n\nМожлива жесть почнеться, коли у людей кінчиться їжа. Тут деякі дурікі приїхали ледь не в одних трусах. І тепер сидять на шиї у інших. Вони, схоже, уже лазять по хатах і крадуть курей і гусей.\n\nІнколи пробиваються смс від Олі, хоч взнаємо новини.\n\n \n\nНастрій так собі. Вийти назад до своїх не реально, підірвані мости, навіть Малий Круполь захоплений. Тому що буде, те буде.\n\n \n\nНажаль, США виступало до війни кожен день, а зараз сховалися. Про ЄС мовчу. Тікі прапор і смайлікі. Ну хоч щось. Хоча що це дасть щось тим, хто під градами чи в окупації? Звісно добре, що вони збирають гуманітарку і їжу, але як вона дійде до дійсно тим, кому вона потрібна? Вона в основному іде туди, де і так їжа є - не окуповані території. Тому виходить так, що наче і допоміг, зібрав купу речей і їжі, але...дійсно страждучим нічого не доходить, лише тим, які і так не погано живуть.\n\n \n\nВ гаражі знайшов квасолю, грам 100. Їй три роки. Вирішили все одно зварити і з'їсти. Крутили мед, на стінках залишилося - все зібрали ложкою і в банку.\n\n \n\nОт сидиш під танками і думаєш, чи вірний був вибір? Потім бачиш обстріли Чернігова, Харькова, передмість Київа - і жахаєшся. Що ми ще не дуже погано живемо, град не виє над нами і не бомбардують зверху. Стоять танки, але поки нікого не чіпають.\n\n \n\nТак як ми без інтернету, то дивимося телеканал. Показують якийсь треш: родила трійню в підвалі, Лжичко зібрала хлам в карпатах, отой жирдяй качок на фоні гір розповідає як він буде змагатися з росіянами...плюс якісь жовтоблакитні паради в Берліні, футбольні матчі \"Україна ми з тобою\" і тд. Це чисто щоб люди думали, що чимось корисним займаються. А не вводять закрите небо і перешкоджають знищенню цивільного населення з повітря. Типова демократична стурбованість. За яку платять життям тисячі українців і ми по факту воюємо одні проти двох країн.\n\n \n\nНе знаю, що буде при наступу наших, якщо він буде. Чи роздовбають село, чи ні? Хочеться, щоб вони просто видохлись і пішли звідси або з бронею, або без.",
      "dateAdded": "2022-03-10",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Перший запис в щоденнику.\n\n## Сьомий день. Середа, 2 березня\n\n \n\nЗник зв'язок, світло ще є.\n\n \n\nТри дні тому прямо на мосту танк розстрілював якісь будівлі, підірвали АЗС. Наразі тихо. Інколи стріляла БМП, а також кулемети. Але два дні більш-менш тишини.\n\n \n\nТрошки відновлю події за цей тиждень.\n\n \n\n## Середа, 24 лютого.\n\nПрокинулись від бомбардування Києва, удари були дуже гучні. Не розуміли що робити, але слава богу основні речі були зібрані.\n\n \n\nВ 8 ранку додумався побігти в магазин і докупити їжі. Черги були, але за 30 хв пройшли. В банкомати людей вишикувалось набагато більше. Купив ще води, каш. Жаль, що не набрав круп і іншого.\n\n \n\nПочав переносити частини речей в машину в паркінг. Зніс їжу, воду, ковдри, на рахунок, якщо ночувати в паркінгу.\n\n \n\nПомилки: треба було докупити ще більше круп, хліба і медикаментів. Завжди треба докуповуваться так, наче це останній раз.\n\n \n\n## Другий день, 25 лютого.\n\nРакетний удар в 4 ранку. Ракета упала на будинок через проспект. Зруйнувала його майже весь. Це дало поштовх нам в 11 ранку виїхати в Нову Басань.\n\nДосі не знаю, чи це був правильний вибір, адже це лівий берег і в напрямку ворога, але це село, є вода і дрова. Тому тепло і вода будуть завжди.\n\n \n\n## Третій день, 26 лютого.\n\nВдень зганяв в магазин, відстояв чергу 3 години. І знову не накупився на всі можливості. Але ще розплатився карткою. Слава богу. Докупили медикаментів.\n\n \n\nПочали бомбити Ніжин. У нас теж було чутно вибухи. Підірвали міст в Бикові. Щоб з Сум не пройшли до нас.\n\n \n\n## Четвертий день, 27 лютого.\n\n \n\nПрокинулися від звуків бою і дуже гучних вибухів з вібрацією. Почав терміново все зносити в підвал. Бій почався прямо на мосту, метрів 500 від нас. Зніс дітей вниз, наносив ще речей, палетів. Сховалися внизу. Дід бачив спалахи вогню з ствола танка. Потім почали гатити канонадой, стало дуже страшно, влізли в підвал.\n\n \n\nЧерез дві години вийшли. Облаштували підвал. Відкачували маму, їй стало погано. Пігулки допомогли.\n\n \n\n## П'ятий день, 28 лютого.\n\n \n\nІнколи хтось стріляв. Ходило багато колон. Десь 200 техніки.\n\n\n\n## Шостий день. 1 березня.\n\n \n\nДо нас прийшли родичи ночувати. У них танк прямо у воротах стоїть. Вони не витримали і втікли через городи. За ними стволом водив бмп\n\n \n\nНайгірший психологічний день на сьогодні. Дуже важко було на душі всім. Якийсь переломний день. Не хочеться залишатися в окупації. Єдині думки: майбутнє дітей.\n\n \n\n## Сьомий день. 2 березня.\n\nінколи стріляють. вирубили зв'язок. Є лише телевізор. Вранці настрій був піднесений, поговорив з Олею. Мамі стало погано, коли виключили зв'язок.",
      "dateAdded": "2022-03-10",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Четвертий випуск Подкасту Дикого Поля.\n\n![podcast_4.png](podcast_4.png)\n\nВирішив зробити ще один запис з розробкою ремейку моєї гри Слобода на Unity.\n\nЗа годину потеревенив про прогрес в Unity, порівняння з \"сучасними\" методами і інструментаріями розробки, а також додав Млин в гру. Ще розповів чому Clojure - лайно, про донатні помийки на Play Store, огляд Баті на ДОУ і таке інше.\n\nЗаходьте: [Додаємо Млин в гру](https://www.youtube.com/watch?v=sRAwe3kIHQQ)",
      "dateAdded": "2021-12-16",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Нова стаття про важливість освіти. \n\n ![KPI_Logo.png](kpi_logo.png)Вирішив зробити невеличку статтю про те, чому технічна освіта потрібна, і чому не варто новому поколінню розповідати, що студентські роки треба проводити на галері, чи в якихось шарагах заробляючи гроші, а не вештаться по КПІ чи Шеві, бо там 'нічому не вчать.'. \n\n Чому ж там насправді вчать спробуємо розібратися зовсім скоро.",
      "dateAdded": "2021-11-28",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Рецензія #1 на ДОУ Подкаст \n\n Вирішив зробити відповідь на злочинні думки оголошені в ДОУ подкасті. \n\n Повна версія тут: [https://dmytrogladkyi.com/#/catalog/posts/review_dou_1](https://dmytrogladkyi.com/#/catalog/posts/review_dou_1)",
      "dateAdded": "2021-11-25",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Remake of Sloboda in Unity\n\nLast time I checked stats of my games on Google Play was a month ago or so ⌛️.\n\n![Google Play Stats](google_play_stats.png)\n\n[Sloboda](https://locadeserta.com/citybuilding) is still my #1 game.\n\nBy amount of effort put into it and by amount of features 😎\n\nI plan to remake this game but this time instead of [Flutter 💙](https://flutter.dev) I will use Unity.\n\n# Why Unity?\n\nI spent a month learning and creating game with Unreal Engine. I found that blueprints is not for me.\nNot even mentioning that C++ is also not for me :) Also the Engine has too many settings, ways of doing it and so on.\n\n## So, why not Unreal Engine?\n\n- Blueprints madness\n- C++\n- Too many settings for everything in Editor\n- Terrible official tutorials\n- Too few amateur tutorials\n- Tooling that does not work (could not compile it for Android)\n- Shaders compilations can take an hour\n\n## I prefer Unity because:\n\n- C#\n- simpler editor\n- AMAZING official Tutorials\n- all questions answered on youtube by creator.\n- Tooling that just works. Two clicks and I deployed app to Android and iOS devices in 2 minutes.\n\nC#, on contra with C++, is the same as Dart. Which I love. Sometimes I even copy-paste code from Flutter into\nUnity C# scripts and it requires only slight changes in order to compile.\n\n## Progress report\n\nMy new game can already:\n\n- upgrade/build buildings\n- character movement with joytstick\n- can pick/drop resources from floor\n- can move resources\n\n![Sloboda Unity](sloboda_unity_pick.png)\n\nI plan to borrow gameplay mechanics from [Unrailed!](https://store.steampowered.com/app/1016920/Unrailed/)\n\n### Where to get news?\n\nI host a Telegram channel (Ukrainian): [Loca Deserta](https://t.me/locadesertachumaki). Тут постю постійно апдейти з відосами :)\n\nYou can also follow me on (Dmytro Gladkyi Twitter)[https://twitter.com/dmytrogladkyi].\n\n",
      "dateAdded": "2021-11-25",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# Історія про Singleton\n\n## Введення\n\nЯкось місяць тому я обіцяв моїм шановучам написати історію про один Singleton, який завалив завод.\n\nЗавод виробляв одну одиницю продукцію кожні 90 секунд. Вартість товару коливалась між 10 000 та 45 000 доларів.\n\nТобто, півтори хвилин простою коштували мінімум 10к доларів.\n\n## Початок кінця\n\nСправа була дуже давно, ще коли на [ДОУмийці](https://dou.ua) були відкриті коментарі і було свавільна воля. Один з моїх колег наярював на джаві, з себе корчив мега архітектора (це вроджений недолік всіх джавішнутих). \n\nЯкось я помітив у нього книгу **\"101 патерн для Java\"**, чи щось в такому дусі. Всі 800 сторінок були лістінги якихось патернів на 5 скролів. В джаві ж щоб відкрити файл треба заюзати 5 патернів, 7 класів, 2 інтерсептора і все одно всраться, **бо без спрінга уже жоден джавіст не здатен вичитати перший рядок файлу**. Я у нього спитав, навіщо в 20ХХ році купляти паперові книги, на що отримав відповідь **\"я не понимаю, когда читаю с екрана\"** (піздец уже сам по собі).\n\nВ той момент він розробляв для мене фічу, яка мала приймати кол з обладнання і записувати вхідні метрики до нас в базу, плюс тригерити оновлення результатів валідації даних.\n\nЯкщо простими словами: код мав отримати значення на якій операції робітник закрутив болт, на скільки градусів у нього це відбулося. Якщо градусів вийшли більше за ліміт - значить болт зірваний. і далі не можна обробляти цю деталь. Якщо градусів менше нижнього ліміту - значить не докрутив болт, і він випаде. Такий собі валідатор болтокрутів.\n\nЩо мені запам'яталось, в момент, коли він закрив тікет, на його столі лежала ця книга з купою поміток на абзаці про Singleton. Ну думаю, молодець, що учиться. Я тоді наярював на Clojure, тому ці всі патерни були до сраки. Як і зараз :)\n\n# Проходить пів року\n\nЯ і інші колеги висаджуємося десантом до замовника в США. Будемо робити go-live продукту. Наш продукт являється ключовим: весь конвеєр залежить від працездатності нашої системи контролю виробництва. Тобто, якщо наша частина не дає добро, то весь конвеєр стоїть. На тому заводі було 140 робочих місць, багато з них спарені, тобто десь 200 загалом.\n\n## Go Live\n\n### Перша ластівка\n\nДесь на третій день після тестових ранів, почали звітувати про помилки нам. Так як працювали в великій корпорації, то задача кожного розробника була звалити тікет або багу на інший підрозділ, а самим завжди залишатися сухим. Як завжди, в таких ситуаціях, лякали, що запуск GoLive іде на особистому рахунку нашого CEO в Америці і особисто CFO замовника. \n\nЦе тоді ще мене лякало, а зараз не дуже, якщо чесно. Стільки разів це все було \"борд особисто контролює\", потім виявляється, що всім насрать десь на рівні середнього менеджменту як у нас, так і у кастомера.\n\n### Помилка\n\nПомилка була в тому, що на станції, де закручують болти, інколи наша система видавали дивні значення, які не відповідали дійсності. Мало закрити на 4.5 оберти, а показує 3. І тому не дає далі рухатися конвеєру. Звісно почали валити все на чуваків, які робили ПЗ для станків. \n\n**Там був повний колхоз на .NET, вони все слали завжди як GET**, навіть якщо якісь дані треба було відіслати...ще і стрінгою \"4.5\"...Ще і без будь-який логів, чи варіанту як глянути, що ж там станок послав насправді.\n\nАле головна проблема була в тому, що це траплялось раз в день. Інколи не траплялося взагалі.\n\n### Іду в засаду\n\nЯ не вірив цим робітникам, що якийсь конкретний мотоцикл може заглючувати нашу систему і зробив спостережний пост біля станції, де останнє бачили цю багу.\n\nСтояв я так три години, паралельно дивлячись логи на всяк пж. Тут хопа, робочий клас почав махати руками і кликати мене. \n\n```\nЗабігаючи наперед скажу, що діти Леніна ненавиділи нас всім серцем. Деякі у відкриту сказали, що нас відпиздять на заводі прямо, якщо ще раз зірветься їх зміна. Бо якщо простій більше 45 хв, то оголошується про закриття зміни і всіх розпускають додому, а зп платять там по факту роботи в приміщенні...Також врахуйте, що робочі в США це як в Ковбої Марльборо типажі - кожен другий качок з ножем або стволом. Кому цікаво, то напишу історію про цікавого амера, як він проніс ствол на завод в столовку.\n```\n\nЯ підхожу - хопа! Болт недокручено, хоча робочий божиться, що все ок було, болтокрут показав 4.5 у себе на датчику, а у нас показує 3. \n\n**І ТУТ МЕНІ ЯК ПО ГОЛОВІ ДАЛО**\n\n```\nБОЛТОКРУТ БУВ ТАНДЕМНИЙ\n```\n\nТобто, одна гашетка закручувала одразу два спарених болта (мабуть, щоб не перекосило деталь і ідентична синхрона сила була прикладена).\n\nМене почав бити холодний піт, я став відходити назад до свого лептопа.\n\n***Два болта синхроно.***\n\n**Синхроно.**\n\nВиклик нашого REST API **синхроно...**\n\nСервак процесить все за 2мс...в найгіршому випадку (це було до ваших сраних мікросервісів, де щоб щось зробити треба 7 інших рестів послати з сервака на сервак, замість одного запиту в бд).\n\n**І тут як флешбек з В'єтнаму перед очима сторінка \"101 Патерн Джави\" з відкритою сторінкою Singleton.**\n\nЯ зібрав лептоп і чкурнув до Бойової кімнати. Це було кодло всіх інженерів, штук 10-15 завжди сиділо. Чомусь, коли треба зробити реальну роботу, завжди забивають на всякі скрами, отжайли, вигоняють всіх скам мастеров і не заважають інженерам працювати, тому я любив бути у відділі кастомізацій для замовників).\n\nШвидко поділився побаченим з колегою. Вона швидко сіла дебажить і дивиться, що може статися з синхроним викликом сервіса з двох місць.\n\nСам на SOAPUI швидко варганив скрипт для відсилки 100 результатів болтокрутів на 20 різних операцій.\n\nЧерез 10 хвилин почув вердикт: **\"Єто Піздец\"**.\n\n## В чому сіль\n\nАвтор функціоналу заюзав Singleton для входу в обробку результату болтокрута. Дані сетав в проперті, щоб зручніше було. Якщо одночасно заходило декілька запитів, то хто куди що запише ставало не ясно, адже попередній запит ще міг не відпрацювати, а наступний уже загадив проперті, тому комплітер першого реквесту починав срати дані не для потрібної операції.\n\nТобто, Болтокрут #1 має закручувати на 4.5 оберти. А болтокрут #2 - на 3. Тому, коли декілька таких тандемних болтокрути крутили гайки, то вони збільшували вирогідність, що якийсь із запитів прийде одночасно з іншим запитом з іншої станції, де працював інший болтокрут. І що виходило, на специфічних мотоциклах, де треба були оці тандемні закрутки, дуже сильно збільшувався шанс, що робочі пошлють дані в один момент часу. Тому бага і стріляла раз в пару днів...\n\n\nМи швидко це перевірили на моїх SOAPUI скриптах (до речі, кльова тула). Ішуя репродюсалась навіть на 5 синхроних запитах. Результати болтокрута залітали куди попало, рандомом взагалі по цих 5 операціях.\n\n## Полегшення\n\nШвиденько підлатали процесор запиту, я перевірив на дев серваку (тоді не було клаудів, все можна було запускати локально за 5 хв). Ішуя зникла! SOAPUI тести всі проходять!\n\nПопросили вікно для деплоя, нам його дали.\n\nПісля цього ішуя зникла назавжди. Через 3 дні нарешті цю вері хай імпакт ішую закрили.\n\n# Вердикт\n\nА от юзав би Functional Programming, все було б добре! Ніяких там засиронів даних чужими викликами функцій. Прийшли дані - засунув їх як є, immutable гарантує, що ніхто не загадить твої дані з інших процесорів на сервері. \n\n",
      "dateAdded": "2021-11-24",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Пишу нетленку. \n\n Як і обіцяв перед деплатформизацією на ЛІ, пишу нетленку про Singleton, thread safety та втрату 20к доларів за півтори хвилини стоячого продакшна заводу. ![screen_md.png](screen_md.png)",
      "dateAdded": "2021-11-23",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Examples for Flutter Web\n\n Original URL with my reddit comment: [r/FlutterDev](https://www.reddit.com/r/FlutterDev/comments/qmi639/please_drop_the_link_to_your_flutter_web_apps/hk78k5p/?context=3) As you might notice, I am a fan of Flutter Web 💙🕸\n\n(btw, if you are a fan of Flutter Web then add 💙🕸 to your profile titles, so it will be easier for our sect to notice colleagues)\n\nThere was a discussion on Reddit (*0). Someone asked to provide examples for Flutter PWAs.\n\n# Here is my full post\n\n## I have half dozens of Flutter web apps as examples 👍💪👇 :)\n\nI've been the Flutter Web user from the very first day they announced it as a \"one more thing\" at their first conference.\n\nI immediately compiled my interactive fiction runner & editor for the web and it all worked from the very beginning.\n\n**Here is up to date version of my first flutter web app (interactive fiction runner&editor)**\n\n[https://locadeserta.com/game/?lang=en#/](https://locadeserta.com/game/?lang=en#/)\n\n\n🧠 My very latest **trading game Chumaki also has a Web version** (make sure to switch to English)\n\n[https://locadeserta.com/chumaki/](https://locadeserta.com/chumaki/)\n\n\nAnd, I think, the **most 🤯 sophisticated ever made Flutter Web app is my previous game Loca Deserta: Sloboda**. This is a task-based city building strategy game that has multiple maps, researches, building upgrades, random events, interactive fiction embeddings, and tones of other features:\n\n(make sure to change language to EN at the top :) )\n\n[https://locadeserta.com/sloboda/#/](https://locadeserta.com/sloboda/#/)\n\n**The last game I did for fun: Hex Puzzle 🧩:**\n\n[https://locadeserta.com/hex/#/](https://locadeserta.com/hex/#/)\n\n\nLinks to iOS/Android/Windows builds of the same games are all here 👇\n\n[http://locadeserta.com/index\\_en.html](http://locadeserta.com/index_en.html)\n\n\n✍ I blog about the Flutter & Game dev in articles like this:\n\n[https://dmytrogladkyi.com/#/catalog/posts/flutter\\_animate\\_interactive\\_viewer\\_as\\_map](https://dmytrogladkyi.com/#/catalog/posts/flutter_animate_interactive_viewer_as_map)\n\n\n```\n^^^ that site is also Flutter Web 🕸💙\n```\n\n\n## As for performance\n\nI have iPhone 11, Galaxy Tab S7, Sony Xperia XZ1 Compact, Galaxy Note 10 Lite, Galaxy S21/S21Ultra, iPad 2017, Nokia 5.2, Oukitel 10000\n\n\nOn all of these devices my games runs very smoothly, **except on Galaxy Note 10 Lite**. I think its CPU is underpowered (some mediatek...) that is why it lacks so much behind.\n\n\n👉I like to go to smartphone shops and check my online games. **I must say that in last year the new cheap devices like Meizu/Xiaomi started performing quite well when I open my games in Android Browser.** Any other devices in a range $500+ will perform well\\*. I think Snapdragon 855 is a minimum requiremenet to have 60FPS in Flutter Web.\\* Of course, sometimes there are glitches, but they are present even in \"real\" web apps done with JS and HTML. Page refresh fixes it as usual haha.\n\n\n**👑 iOS Safari is an absolute King of performance** as it was running 60FPS even back in 2018\n\n\nPer tweets from Flutter team they started giving 💙🕸 more time. I expect starting screen improvements, reduced bundle size, improvements in PWA to be merged in next stable release.\n\n\nStay tuned and Always Bet on Flutter (c) Dmytro Gladkyi",
      "dateAdded": "2021-11-23",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# Засилля шарлатанів. \n\n Навіяно [Черговими помиями копірайтерів на ДОУмийці](https://dou.ua/forums/topic/35415) \n\n Якось ще 5 років тому, ось ці всі психологи, психологіні, гештальт коучери вигорання і інші паразити взагалі не існували в наших степах. Але щось трапилося, і кожна друга контора строчить ось такі пости *0 на ДОУмийку ![4.png](4.png) При чому, що створюється така кількість контенту на всіх ресурсах, що інші люди теж починають думати, що у них проблеми з головою, токсікі в командах, нещасливе дитинство, батько алкаш і тд. \n\n\n\nХоча насправді, ці шарлатани лише відпрацьовують своє лаве, створюючи проблеми там, де їх немає. Прямо як agile coaches та скрам мастера. Судячи з усього, через пару років їх витіснять ось такі PhD Psychology з інститута Макаренка, факультет вивчення Пірамідок. Будуть сидіти на дейліка і питати у нас, \"як вигорів, чому не хочеш брати цю таску з 2017 року в джирі, може проблема в тобі?\"\n\n",
      "dateAdded": "2021-11-19",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "I like it when Devs of Old Web say that Flutter is not the Future because it would break all the web.\n\nyet a single Ad Block extension ruins 99% of their web sites that don't even load anymore. And these pages have no interactivity at all",
      "dateAdded": "2021-11-19",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# MetaPersona progress\n\n Finally I had time to implement micro blogging on meta persona profile: [This site](https://dmytrogladkyi.com) I can now embed tiny markdowns, even with images for each micro. \n\n Like this: ![3.png](3.png) \n\n Micro is a Tweet but in Meta Persona context. Check sources on [https://github.com/gladimdim/metapersona](https://github.com/gladimdim/metapersona)",
      "dateAdded": "2021-11-17",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# First MetaMicro ever.\n\nThis is my first Meta Micro post ever added to #metapersona profile\n\nThis can have something embedded inside\n\nOr maybe not hehe\n\n How are you?",
      "dateAdded": "2021-11-17",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# 🌟 Другий мікро українською :)",
      "dateAdded": "2021-11-17",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# 🌟 Перший мікро українською :)",
      "dateAdded": "2021-11-17",
      "languageEmoji": "🇺🇦"
    }
  ]
}