{
  "micros": [
    {
      "content": "# Рецензія #1 на ДОУ Подкаст \n\n```\nЦей мікрос являється чисто розважальним контентом, якщо вам не подобається, що тут написано, то ідіть нахуй, мені похуй :)\n```\n\nНарешті в команду ДОУ приєднався новий ведучий (ну як новий, уже випусків 20 є з ним :) ), тобто хтось крім пхп одміна і шайки \"журналістів\" з'явився хоч хтось, хто має відношення до айті, і тому ми можемо дивитися дуже цікаві інтервью з різними людьми на каналі [ДОУ](https://www.youtube.com/watch?v=ZNJAmgO4H7c)\n\n![Dou3.png](dou3.png)\n\nОстаннє інтервью було з СТО/CPO Олександром Соловйовим, яке вийшло дуже цікавим, тому хотів би прокоментувати дещо з його реплік і взагалі про теми, які піднімали ведучій і гість.\n\n```\nДисклеймер: ми з Олександром були в одній групі на ФІОТ, хоча він і мало ходив на пари, але особисто знайомі :)\n```\n\n# Пошла Жара\n\n![Dou0.png](dou0.png)\n\nДалі буде розбивка всього інтервью на частини, які б хотів прокоментувати\n\n## [Покупка SAP](https://youtu.be/ZNJAmgO4H7c?t=493)\n\nТут звісно зайшов з вертушки одразу, я таке люблю і часто сам роблю цей НЛП прийом.\n\n**Коротко: \"ми робимо своє, бо якщо купимо САП, то це буде кінець.\", \"САП ломає через коліно\" і тд.**\n\nВсі ці цитати взяти з лурка, судячи з усього, [з відомої статті](https://lurkmore.to/SAP). Вона дуже ржачна і має багато правди, але як людина пропрацювавши 10 років в САП в розробці системи управління виробництвом (Discrete Manufacturing Industry) **вимушений винести вердикт: це все ахінея.**\n\nВсі, хто каже, що САП ломає об коліно, зазвичай знаходяться на низькому рівні розвитку бізнесу, процесів. Це як після середньої школи з двієчниками попасти в фізмат ліцей, де і правила інші, і рівень дітей інший, і взагалі всі процеси побудовано по-іншому. А не гуляй-поле сш №15, де роби що хочеш. Так, САП заставляє робити процеси в бізнесі правильно.\n\nСАП це екосистема, де підрядчик, поставщик, бухгалтер, звіт, контакт в державі, агент і тд всі мають підпадати під загальний так би мовити клас. Тобто, те, що ви там гавняли дві бухгалтерії на 1С - одну для податків, одну для себе - це чисто ваша проблема, а не проблема САП, який це не дозволяє робити. Якщо у вас завод якогось хера не трекає простій станків і їх амортизацію - то це ваша помилка як керівника. Адже при отримані замовлень такі параметри можуть запитати ті самі замовники, чи перевірка від державних органів.\n\n```\nОдин з смішних прикладів ось такий \"упрощенцев\" \"САП фу\" трапився зі мною на одному форумі.\n\nМи показували свій продукт, 3д візуалізацію зборочної операції з підсвіткою всіх елементів,\nде були зарепорчені дефекти. Крута штука.\n\nПідходить представник КАМАЗу.\n\n- ЧТО ЄТО?\n- Це візуалізація і інструкція по сборці щеплення для машини\n- И ЧТО?\n- ???\n- ЧТО ВАШ САП МОЖЕТ?\n- Еееее, ти про що?\n- Как ви трекаете детали, что их установили или списали?\n- У нас в системі ведеться повна генеалогія продукту, можна подивитися в яке щеплення яка деталь з якої партії зайшла.\nЯкщо були дефекти - вони списується на утіль або переробку\n= ХУЙНЯ\n- ??\n- НУ ВОТ МОЙ РАБОЧИЙ НАБРАЛ ПОДШИПНИКОВ В КАРМАН І ВІНЕС С ЗАВОДА. КАК ВАШ САП ЄТО ЗАМЕТИТ? ХЕРНЯ ВАШ САП!\n```\n\n**Всі ж знають Apple? А на їх виступах часто вони розповідають, що кремній і алюміній** в їх макбуках не містить дитячої праці, чи праці рабів, чи знедолених. Чи не з країни, яку США внесла в список терористичних. Як ви думаєте вони це все трекають через ланцюг з 100 агентів? А тепер давайте результати роботи от таких кулібіних в кожній конторі об'єднайте в один звіт і відішліть Куку на апрув. Я почекаю. **На кложур написали скриптик \"у нас немає дітей на заводі\", згенерили пдф і відіслали госдепу, і все?**\n\nНі. По-перше, такий звіт ніхто у вас не прийме, якщо він не буде встановленої форми, від довіреної особи чи перевіряльщика (всякі паразити типу Делойта чи Прайсів тут пасуться завжди). Ви будете витрачати свій час, наймати всіх цих паразитів? Контракт з Аплом уже уйде іншому, у якого уже стоїть вся ця інтегрована екосистема. Де за декілька кліків мишею ти можеш отримати доступ до виробників, які 100% уже перевірені, відповідні мають документи і ти впевнений, що проблем не буде потім. Ну або робити як пропонує Олександр - гавнять щось своє :))\n\nТакож я маю великий досвід, коли наше ПЗ встановлювалось на завод, де до цього орудували ось такі самоделкіни, де навіть технічна документація і стандарти не дотримувались, за що завод платився як штрафами, так і втратами замовлень. А все тому, що кулібіни скзаали **\"НАХЕР ТОЙ САП, МИ ТУТ САМІ ЗАРАЗ ХУЯК ХУЯК І В ЖСОНЧІК\".** або **\"ОЙ САП ЄТО СЛОЖНО, У НАС ТУТ УЖЕ ЕСТЬ СЕРВАЧОК НА .NET ЩАС ПРИКРУЧУ ЕЩЕ ПАРУ ТРЕКАЛОК ЗАВОДА\"**\n\nА потім приходить злий САП і каже, а чому у вас в записах всі цифри указані без одиниць виміру? (приміром). Ось у вас позиція - Клей: 300. 300 чого? Як казала моя математичка - \"300 чого? СОБАК?\"\n\n**Так що, якщо ваш бізнес, це продавання кед перекуплених на аліку з 15% маржею місцевих бариг**, то так. Кложур в зуби і вперед. Якщо щось серьйозне, або вас хочуть купити, або ви хочете вийти на біржу, то рано чи піздно ви приходите до дорослих дядь. Тобто в САП, або Оракл, або МС. І інтегруєтесь. Рівень болі залежить від рівня на якому ви були, коли почали дорослішати.\n\n## [Про КПІ](https://youtu.be/ZNJAmgO4H7c?t=2931)\n\nЯкщо коротко історія гостя: кудись там вступив, кудись там прийшов, щось випадково подав документи, хтось там випадково передзвонив, щось там вчив, общага круто, навчання гавно, роблю сайти для продажу товарів онлайн, навіщо той мені був КПІ з кафедрою Технічної Кібернетики, який готував інженерів для виробництв?\n\n![DOU1](dou1.png)\n\n```\nНе скажу, що я спецом ішов на ФІОТ, бо перший факультет я вибрав Прикладну Маметатику, але прохідний бал був 32 (туди пішла все кодло з ліцею КПІ), а у мене було 30 (чи 28), а ФІОТ як раз 28 балів виставив. Я проходив після курсів підготовки КПІ, тому здавали екзамен в травні чи квітні.\n```\n\nНу якщо все якось випадково там якось вийшло, то мабуть дійсно не в свій факультет попав. Історії про круту общагу, це як Стокгольмський синдром - з часом починаєш захищяти якийсь лютий треш: бухання, планчік, траходроми, ДОТА по 72 години нон стоп, хтось насрав прямо в мильниці в душових, пізділки з китайцями. Дійсно, навіщо тут навчання, якщо стільки цікавого навколо.\n\nВзагалі, всі противники і обсиратори КПІ чи Шеви, це ось так \"випадково щось там якось вийшло залетів на Мехмат, фу гавно якусь херь учили, мені в житті вона не треба\". \n\nА я, наприклад, прочитав діаграма Ганта (ну це десь 2-3 курс в КПІ наче), за що супервайзори на заводі на Harley Davidson випали в осад, бо для них це ледь не скрижалі, які можуть читати лише вони втрьох, а всі інші чекають на них. А тут якийсь чел приїхав хер зна звідки в їх культурну США, ще і шарить так. До речі, після цього чомусь почали ховати від мене всі їх графіки, не знаю чому :) Думали, що я шпіон?\n\nКому цікаво прочитати інший випадок під час запуску величезного заводі, то прямуйте [на мою нетленку про сінглтон](http://dmytrogladkyi.com/#/micro/8)\n\n## [Про Світчерів](https://youtu.be/ZNJAmgO4H7c?t=4332)\n\n![DOU2.png](dou2.png)\n\nГість: раніше люди любили компьютери, цікавились, розбирались і ішли в програмісти, а зараз: бухав до 17 років, закінчив Кульок, продавав помідори на ринку, пройшов 3 курси ІТ і уже хочу 5к.\n\nПовністю згоден. Завжди мали проблеми (звільняли) ось таких світчерів, які там щось десь тягнули, маючи освіту Педа, працювавши в Польші до 32, а потім \"хопа я уже реактер\". Такі люди не здатні працювати самостійно, завжди вимагали \"скажи конкретно в тікете что сделать\", бо вони не звикли виясняти, розбиратися, дебажить чужий код, налаштовувати звук в лінукс ред хет. Якщо починав їх вчити як це все робиться, то бачив абсолютно порожні очі, які нічого не хочуть вчити чи взнавати.\n\nУ світчерів немає чогось в сердці, любові до техніки, пізнання бінарного світу, навіть банально немає про що поговорити на кухні, бо його цікавить де бухнуть і бляху пригнав кореш піде дивиться.\n\nЗвісно, є і виключення, але я теж надаю перевагу людям, які впевнено йшли до чогось, а не хопа в 30 років я стоматолог. Ви б хотіли, щоб вам зуби сверлив 35 літній світчер з реакту на стоматологію, який пройшов ютюб курси стоматолога?\n\n# Заключення\n\nЦей пост написав для пітримки української спільноти. Адже вона зараз повністю контролюється ПХП одміном і \"редакцією\" \"журналістів\" ДОУ, які чомусь вирішили, що вони тепер модерують всі розмови, і вибирають хто що може говорити.\n\nБудь-який інший ресурс крім ДОУ уже не вилізе навіть з зачатку, адже критична маса людей сидять саме на ДОУ, плюс вони спецом накачують тематики для світчеров, постійні статті про \"працював 70 років на шахті, виліз, вивчив реакт, уже сініор в гемблінг богодельні\". \n\nАбо \"мамой клянусь, нам МягкоПоданий не платит за сороковую статтью за неделю на ДОУ от нашего Главного Психолога по работе с галерними\" (с) [статтями від гештальт шарлатанів, яких почали наймати галери](http://dmytrogladkyi.com/#/micro/5)\n\nТому підтримуйте нові медіа, а саме мій профіль на метаперсоні: [https://dmytrogladkyi.com](https://dmytrogladkyi.com)",
      "publishedOn": "2021-11-25",
      "languageEmoji": "\"\\uD83C\\uDDFA\\uD83C\\uDDE6"
    },  {
      "content": "# Remake of Sloboda in Unity\n\nLast time I checked stats of my games on Google Play was a month ago or so ⌛️.\n\n![Google Play Stats](google_play_stats.png)\n\n[Sloboda](https://locadeserta.com/citybuilding) is still my #1 game.\n\nBy amount of effort put into it and by amount of features 😎\n\nI plan to remake this game but this time instead of [Flutter 💙](https://flutter.dev) I will use Unity.\n\n# Why Unity?\n\nI spent a month learning and creating game with Unreal Engine. I found that blueprints is not for me.\nNot even mentioning that C++ is also not for me :) Also the Engine has too many settings, ways of doing it and so on.\n\n## So, why not Unreal Engine?\n\n- Blueprints madness\n- C++\n- Too many settings for everything in Editor\n- Terrible official tutorials\n- Too few amateur tutorials\n- Tooling that does not work (could not compile it for Android)\n- Shaders compilations can take an hour\n\n## I prefer Unity because:\n\n- C#\n- simpler editor\n- AMAZING official Tutorials\n- all questions answered on youtube by creator.\n- Tooling that just works. Two clicks and I deployed app to Android and iOS devices in 2 minutes.\n\nC#, on contra with C++, is the same as Dart. Which I love. Sometimes I even copy-paste code from Flutter into\nUnity C# scripts and it requires only slight changes in order to compile.\n\n## Progress report\n\nMy new game can already:\n\n- upgrade/build buildings\n- character movement with joytstick\n- can pick/drop resources from floor\n- can move resources\n\n![Sloboda Unity](sloboda_unity_pick.png)\n\nI plan to borrow gameplay mechanics from [Unrailed!](https://store.steampowered.com/app/1016920/Unrailed/)\n\n### Where to get news?\n\nI host a Telegram channel (Ukrainian): [Loca Deserta](https://t.me/locadesertachumaki). Тут постю постійно апдейти з відосами :)\n\nYou can also follow me on (Dmytro Gladkyi Twitter)[https://twitter.com/dmytrogladkyi].\n\n",
      "publishedOn": "2021-11-25",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Історія про Singleton\n\n## Введення\n\nЯкось місяць тому я обіцяв моїм шановучам написати історію про один Singleton, який завалив завод.\n\nЗавод виробляв одну одиницю продукцію кожні 90 секунд. Вартість товару коливалась між 10 000 та 45 000 доларів.\n\nТобто, півтори хвилин простою коштували мінімум 10к доларів.\n\n## Початок кінця\n\nСправа була дуже давно, ще коли на [ДОУмийці](https://dou.ua) були відкриті коментарі і було свавільна воля. Один з моїх колег наярював на джаві, з себе корчив мега архітектора (це вроджений недолік всіх джавішнутих). \n\nЯкось я помітив у нього книгу **\"101 патерн для Java\"**, чи щось в такому дусі. Всі 800 сторінок були лістінги якихось патернів на 5 скролів. В джаві ж щоб відкрити файл треба заюзати 5 патернів, 7 класів, 2 інтерсептора і все одно всраться, **бо без спрінга уже жоден джавіст не здатен вичитати перший рядок файлу**. Я у нього спитав, навіщо в 20ХХ році купляти паперові книги, на що отримав відповідь **\"я не понимаю, когда читаю с екрана\"** (піздец уже сам по собі).\n\nВ той момент він розробляв для мене фічу, яка мала приймати кол з обладнання і записувати вхідні метрики до нас в базу, плюс тригерити оновлення результатів валідації даних.\n\nЯкщо простими словами: код мав отримати значення на якій операції робітник закрутив болт, на скільки градусів у нього це відбулося. Якщо градусів вийшли більше за ліміт - значить болт зірваний. і далі не можна обробляти цю деталь. Якщо градусів менше нижнього ліміту - значить не докрутив болт, і він випаде. Такий собі валідатор болтокрутів.\n\nЩо мені запам'яталось, в момент, коли він закрив тікет, на його столі лежала ця книга з купою поміток на абзаці про Singleton. Ну думаю, молодець, що учиться. Я тоді наярював на Clojure, тому ці всі патерни були до сраки. Як і зараз :)\n\n# Проходить пів року\n\nЯ і інші колеги висаджуємося десантом до замовника в США. Будемо робити go-live продукту. Наш продукт являється ключовим: весь конвеєр залежить від працездатності нашої системи контролю виробництва. Тобто, якщо наша частина не дає добро, то весь конвеєр стоїть. На тому заводі було 140 робочих місць, багато з них спарені, тобто десь 200 загалом.\n\n## Go Live\n\n### Перша ластівка\n\nДесь на третій день після тестових ранів, почали звітувати про помилки нам. Так як працювали в великій корпорації, то задача кожного розробника була звалити тікет або багу на інший підрозділ, а самим завжди залишатися сухим. Як завжди, в таких ситуаціях, лякали, що запуск GoLive іде на особистому рахунку нашого CEO в Америці і особисто CFO замовника. \n\nЦе тоді ще мене лякало, а зараз не дуже, якщо чесно. Стільки разів це все було \"борд особисто контролює\", потім виявляється, що всім насрать десь на рівні середнього менеджменту як у нас, так і у кастомера.\n\n### Помилка\n\nПомилка була в тому, що на станції, де закручують болти, інколи наша система видавали дивні значення, які не відповідали дійсності. Мало закрити на 4.5 оберти, а показує 3. І тому не дає далі рухатися конвеєру. Звісно почали валити все на чуваків, які робили ПЗ для станків. \n\n**Там був повний колхоз на .NET, вони все слали завжди як GET**, навіть якщо якісь дані треба було відіслати...ще і стрінгою \"4.5\"...Ще і без будь-який логів, чи варіанту як глянути, що ж там станок послав насправді.\n\nАле головна проблема була в тому, що це траплялось раз в день. Інколи не траплялося взагалі.\n\n### Іду в засаду\n\nЯ не вірив цим робітникам, що якийсь конкретний мотоцикл може заглючувати нашу систему і зробив спостережний пост біля станції, де останнє бачили цю багу.\n\nСтояв я так три години, паралельно дивлячись логи на всяк пж. Тут хопа, робочий клас почав махати руками і кликати мене. \n\n```\nЗабігаючи наперед скажу, що діти Леніна ненавиділи нас всім серцем. Деякі у відкриту сказали, що нас відпиздять на заводі прямо, якщо ще раз зірветься їх зміна. Бо якщо простій більше 45 хв, то оголошується про закриття зміни і всіх розпускають додому, а зп платять там по факту роботи в приміщенні...Також врахуйте, що робочі в США це як в Ковбої Марльборо типажі - кожен другий качок з ножем або стволом. Кому цікаво, то напишу історію про цікавого амера, як він проніс ствол на завод в столовку.\n```\n\nЯ підхожу - хопа! Болт недокручено, хоча робочий божиться, що все ок було, болтокрут показав 4.5 у себе на датчику, а у нас показує 3. \n\n**І ТУТ МЕНІ ЯК ПО ГОЛОВІ ДАЛО**\n\n```\nБОЛТОКРУТ БУВ ТАНДЕМНИЙ\n```\n\nТобто, одна гашетка закручувала одразу два спарених болта (мабуть, щоб не перекосило деталь і ідентична синхрона сила була прикладена).\n\nМене почав бити холодний піт, я став відходити назад до свого лептопа.\n\n***Два болта синхроно.***\n\n**Синхроно.**\n\nВиклик нашого REST API **синхроно...**\n\nСервак процесить все за 2мс...в найгіршому випадку (це було до ваших сраних мікросервісів, де щоб щось зробити треба 7 інших рестів послати з сервака на сервак, замість одного запиту в бд).\n\n**І тут як флешбек з В'єтнаму перед очима сторінка \"101 Патерн Джави\" з відкритою сторінкою Singleton.**\n\nЯ зібрав лептоп і чкурнув до Бойової кімнати. Це було кодло всіх інженерів, штук 10-15 завжди сиділо. Чомусь, коли треба зробити реальну роботу, завжди забивають на всякі скрами, отжайли, вигоняють всіх скам мастеров і не заважають інженерам працювати, тому я любив бути у відділі кастомізацій для замовників).\n\nШвидко поділився побаченим з колегою. Вона швидко сіла дебажить і дивиться, що може статися з синхроним викликом сервіса з двох місць.\n\nСам на SOAPUI швидко варганив скрипт для відсилки 100 результатів болтокрутів на 20 різних операцій.\n\nЧерез 10 хвилин почув вердикт: **\"Єто Піздец\"**.\n\n## В чому сіль\n\nАвтор функціоналу заюзав Singleton для входу в обробку результату болтокрута. Дані сетав в проперті, щоб зручніше було. Якщо одночасно заходило декілька запитів, то хто куди що запише ставало не ясно, адже попередній запит ще міг не відпрацювати, а наступний уже загадив проперті, тому комплітер першого реквесту починав срати дані не для потрібної операції.\n\nТобто, Болтокрут #1 має закручувати на 4.5 оберти. А болтокрут #2 - на 3. Тому, коли декілька таких тандемних болтокрути крутили гайки, то вони збільшували вирогідність, що якийсь із запитів прийде одночасно з іншим запитом з іншої станції, де працював інший болтокрут. І що виходило, на специфічних мотоциклах, де треба були оці тандемні закрутки, дуже сильно збільшувався шанс, що робочі пошлють дані в один момент часу. Тому бага і стріляла раз в пару днів...\n\n\nМи швидко це перевірили на моїх SOAPUI скриптах (до речі, кльова тула). Ішуя репродюсалась навіть на 5 синхроних запитах. Результати болтокрута залітали куди попало, рандомом взагалі по цих 5 операціях.\n\n## Полегшення\n\nШвиденько підлатали процесор запиту, я перевірив на дев серваку (тоді не було клаудів, все можна було запускати локально за 5 хв). Ішуя зникла! SOAPUI тести всі проходять!\n\nПопросили вікно для деплоя, нам його дали.\n\nПісля цього ішуя зникла назавжди. Через 3 дні нарешті цю вері хай імпакт ішую закрили.\n\n# Вердикт\n\nА от юзав би Functional Programming, все було б добре! Ніяких там засиронів даних чужими викликами функцій. Прийшли дані - засунув їх як є, immutable гарантує, що ніхто не загадить твої дані з інших процесорів на сервері. \n\n",
      "publishedOn": "2021-11-24",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Пишу нетленку. \n\n Як і обіцяв перед деплатформизацією на ЛІ, пишу нетленку про Singleton, thread safety та втрату 20к доларів за півтори хвилини стоячого продакшна заводу. ![screen_md.png](screen_md.png)",
      "publishedOn": "2021-11-23",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# Examples for Flutter Web\n\n Original URL with my reddit comment: [r/FlutterDev](https://www.reddit.com/r/FlutterDev/comments/qmi639/please_drop_the_link_to_your_flutter_web_apps/hk78k5p/?context=3) As you might notice, I am a fan of Flutter Web 💙🕸\n\n(btw, if you are a fan of Flutter Web then add 💙🕸 to your profile titles, so it will be easier for our sect to notice colleagues)\n\nThere was a discussion on Reddit (*0). Someone asked to provide examples for Flutter PWAs.\n\n# Here is my full post\n\n## I have half dozens of Flutter web apps as examples 👍💪👇 :)\n\nI've been the Flutter Web user from the very first day they announced it as a \"one more thing\" at their first conference.\n\nI immediately compiled my interactive fiction runner & editor for the web and it all worked from the very beginning.\n\n**Here is up to date version of my first flutter web app (interactive fiction runner&editor)**\n\n[https://locadeserta.com/game/?lang=en#/](https://locadeserta.com/game/?lang=en#/)\n\n\n🧠 My very latest **trading game Chumaki also has a Web version** (make sure to switch to English)\n\n[https://locadeserta.com/chumaki/](https://locadeserta.com/chumaki/)\n\n\nAnd, I think, the **most 🤯 sophisticated ever made Flutter Web app is my previous game Loca Deserta: Sloboda**. This is a task-based city building strategy game that has multiple maps, researches, building upgrades, random events, interactive fiction embeddings, and tones of other features:\n\n(make sure to change language to EN at the top :) )\n\n[https://locadeserta.com/sloboda/#/](https://locadeserta.com/sloboda/#/)\n\n**The last game I did for fun: Hex Puzzle 🧩:**\n\n[https://locadeserta.com/hex/#/](https://locadeserta.com/hex/#/)\n\n\nLinks to iOS/Android/Windows builds of the same games are all here 👇\n\n[http://locadeserta.com/index\\_en.html](http://locadeserta.com/index_en.html)\n\n\n✍ I blog about the Flutter & Game dev in articles like this:\n\n[https://dmytrogladkyi.com/#/catalog/posts/flutter\\_animate\\_interactive\\_viewer\\_as\\_map](https://dmytrogladkyi.com/#/catalog/posts/flutter_animate_interactive_viewer_as_map)\n\n\n```\n^^^ that site is also Flutter Web 🕸💙\n```\n\n\n## As for performance\n\nI have iPhone 11, Galaxy Tab S7, Sony Xperia XZ1 Compact, Galaxy Note 10 Lite, Galaxy S21/S21Ultra, iPad 2017, Nokia 5.2, Oukitel 10000\n\n\nOn all of these devices my games runs very smoothly, **except on Galaxy Note 10 Lite**. I think its CPU is underpowered (some mediatek...) that is why it lacks so much behind.\n\n\n👉I like to go to smartphone shops and check my online games. **I must say that in last year the new cheap devices like Meizu/Xiaomi started performing quite well when I open my games in Android Browser.** Any other devices in a range $500+ will perform well\\*. I think Snapdragon 855 is a minimum requiremenet to have 60FPS in Flutter Web.\\* Of course, sometimes there are glitches, but they are present even in \"real\" web apps done with JS and HTML. Page refresh fixes it as usual haha.\n\n\n**👑 iOS Safari is an absolute King of performance** as it was running 60FPS even back in 2018\n\n\nPer tweets from Flutter team they started giving 💙🕸 more time. I expect starting screen improvements, reduced bundle size, improvements in PWA to be merged in next stable release.\n\n\nStay tuned and Always Bet on Flutter (c) Dmytro Gladkyi",
      "publishedOn": "2021-11-23",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# Засилля шарлатанів. \n\n Навіяно [Черговими помиями копірайтерів на ДОУмийці](https://dou.ua/forums/topic/35415) \n\n Якось ще 5 років тому, ось ці всі психологи, психологіні, гештальт коучери вигорання і інші паразити взагалі не існували в наших степах. Але щось трапилося, і кожна друга контора строчить ось такі пости *0 на ДОУмийку ![4.png](4.png) При чому, що створюється така кількість контенту на всіх ресурсах, що інші люди теж починають думати, що у них проблеми з головою, токсікі в командах, нещасливе дитинство, батько алкаш і тд. \n\n\n\nХоча насправді, ці шарлатани лише відпрацьовують своє лаве, створюючи проблеми там, де їх немає. Прямо як agile coaches та скрам мастера. Судячи з усього, через пару років їх витіснять ось такі PhD Psychology з інститута Макаренка, факультет вивчення Пірамідок. Будуть сидіти на дейліка і питати у нас, \"як вигорів, чому не хочеш брати цю таску з 2017 року в джирі, може проблема в тобі?\"\n\n",
      "publishedOn": "2021-11-19",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "I like it when Devs of Old Web say that Flutter is not the Future because it would break all the web.\n\nyet a single Ad Block extension ruins 99% of their web sites that don't even load anymore. And these pages have no interactivity at all",
      "publishedOn": "2021-11-19",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# MetaPersona progress\n\n Finally I had time to implement micro blogging on meta persona profile: [This site](https://dmytrogladkyi.com) I can now embed tiny markdowns, even with images for each micro. \n\n Like this: ![3.png](3.png) \n\n Micro is a Tweet but in Meta Persona context. Check sources on [https://github.com/gladimdim/metapersona](https://github.com/gladimdim/metapersona)",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# First MetaMicro ever.\n\nThis is my first Meta Micro post ever added to #metapersona profile\n\nThis can have something embedded inside\n\nOr maybe not hehe\n\n How are you?",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇸"
    },
    {
      "content": "# 🌟 Другий мікро українською :)",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇦"
    },
    {
      "content": "# 🌟 Перший мікро українською :)",
      "publishedOn": "2021-11-17",
      "languageEmoji": "🇺🇦"
    }
  ]
}