Repository: gladimdim/metapersona
Catalog: lib/src/localization/app_*.arb
Languages: uk

# appTitle
source: Meta Persona
uk: Мета персона

source: Settings
uk: Налаштування

# profilePageTitle
source: Profile Page
uk: Профіль

# experienceSummaryText
source: Flutter Developer ðŸ’™. 8 years with JavaScript. 3 Years with Flutter :)
uk: Flutter Розробник 💙. 8 років JavaScript. 3 роки з Flutter :)

# viewMyArticles
source: My articles
uk: Мої статті

# viewShortPosts
source: Micros
uk: Мікроси

# viewExperiencePage
source: Professional Experience
uk: Професійний досвід

# labelLoading
source: Loading
uk: Завантажується

# labelAllPosts
source: All Posts
uk: Всі публікації

# labelPublishedOn
source: Published on
uk: Опубліковано

# labelSearch
source: Search
uk: Шукати

# labelMetaProfile
source: Meta Profile
uk: Мета профіль

# titleMicroItemView
source: Micro
uk: Мікро

# labelLatestNews
source: Latest News
uk: Останні новини

# labelLoadingCatalog
source: Loading latest catalog items
uk: Завантаження каталогу статей

# labelFailedToFetchCatalog
source: Failed to fetch catalog items
uk: Помилка при завантаженні каталогу

# labelLoadingMicros
source: Loading latest micros
uk: Завантаження мікросів

# labelFailedToFetchMicros
source: Failed to fetch micros
uk: Помилка завантаження мікросів

# daysAgo
source: {days} days ago
uk: {days} днів тому
